# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

articles = {
  'MarsOne' => "Частный проект, руководимый Басом Лансдорпом и предполагающий полет на Марс с последующим основанием колонии на его поверхности и трансляцией всего происходящего по телевидению. По заявлению самой организации она не является аэрокосмической компанией и все работы по разработке, производству и запуску космических аппаратов будут переданы субподрядчикам. Штат компании составляет 8 человек.",
  'SpaceX' => "Межпланетная транспортная система (англ. Interplanetary Transport System, ITS) — проект аэрокосмической компании SpaceX, предполагающий создание многоразового космического транспорта для доставки людей на Марс с целью создания там в будущем самоподдерживающейся колонии. Подробности проекта представлены основателем компании SpaceX Илоном Маском 27 сентября 2016 года на Международном конгрессе по астронавтике в Гвадалахаре, Мексика."
}

articles.each do |title, text|
  Article.create!(title: title, text: text)
  puts "Creating article..."
end

news = {
  'Запуск пятого этапа частного проекта Mars One с 2026 года переносится на 2031-й' => "Ранее планировалось, что через 10 лет на орбиту Земли будет осуществлена отправка транзитного модуля и корабля, на борту которого будет присутствовать «сборочный» экипаж. После этого намечалась смена данного экипажа первой четверкой миссии Mars One, и только по окончанию контрольной проверки системы на Красной планете и транзитного модуля, в 2026 году состоялся бы первый запуск на Марс пилотируемого корабля, экипаж которого составлял бы четыре человека. Одновременно собирались отправить груз, обеспечивающий жизнь второй команды космонавтов. Как предполагалось, эта четверка добралась бы до конечной цели в течение семи месяцев, после чего приступила к созданию первого человеческого поселения.<br>Однако руководство организации приняло решение перенести запуск миссии Mars One еще на пять лет. Это обусловлено изменениями в программе финансирования. Недавно компанию выкупила швейцарская фирма InFin Innovative Finance. В ходе сделки изменилась финансовая стратегия.<br>Стоит отметить, что реализация демонстрационной пилотируемой миссии – начальный этап проекта, также отложена на два года, что происходит уже дважды.",
  'SpaceX перенесла первый пилотируемый полёт аппарата Dragon на 2018 год' => "Похоже, что планам Элона Маска по отправке команды астронавтов в космос внутри капсулы Dragon в 2017 году не суждено сбыться. Виной всему опасения, что на взлётной площадке может произойти катастрофа, подобная случившейся в сентябре этого года. Напомним вам, что ракета Falcon 9 взорвалась прямо во время заправки в неё топлива, унеся с собой дорогостоящий израильский спутник AMOS-9.<br>Инженерам SpaceX потребуется дополнительное время, чтобы до мельчайших деталей проработать систему заправки ракеты и исключить возникновение внештатных ситуаций в будущем. По словам представителей компании, в данный момент они сосредоточены на работе над дизайном, рабочими системами, а также процессами, происходящими внутри ракеты на старте. Как бы то ни было, в 2017 году SpaceX всё же поможет произвести тестовый запуск одной из капсул NASA с командой астронавтов внутри. Случиться это должно в следующем ноябре. Примерно в это же время будут протестированы скафандры астронавтов и парашютная система."
}

news.each do |title, text|
  News.create!(title: title, text: text)
  puts "Creating news..."
end
